4ms/stm32mp1-baremetal/ctest/Drivers/BSP/STM32MP15xx_DISCO/stm32mp15xx_disco_stpmic1.c
  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_DeInit(void)
{
  uint32_t  status = BSP_ERROR_NONE;
  if(HAL_I2C_GetState(&hI2c4) != HAL_I2C_STATE_RESET)
  {
    /* Deinit the I2C */
    BSP_PMIC_MspDeInit(&hI2c4);

  }
  return status;
}

/*
 *
 * following are configurations for this board
 * same configuration than linux
 *
 *  BSP_PMIC_InitRegulators set the regulators for boot
 *  BSP_PMIC_PrepareLpStop set the low power registers for LPSTOP mode
 *    should be called by user before entering is CSTOP
 *  BSP_PMIC_PrepareLpStop set the low power registers for STANDBY mode
 *    should be called by user before entering is STANDBY
 *
 *
 */
/* following are configurations */
uint32_t BSP_PMIC_InitRegulators(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  STPMU1_Register_Write(MAIN_CONTROL_REG, 0x04);
  STPMU1_Register_Write(VIN_CONTROL_REG, 0xc0);
  STPMU1_Register_Write(USB_CONTROL_REG, 0x30);

  STPMU1_Register_Write(MASK_RESET_BUCK_REG, 0x04);
  STPMU1_Register_Write(MASK_RESET_LDO_REG, 0x00);
  STPMU1_Register_Write(MASK_RANK_BUCK_REG, 0x00);
  STPMU1_Register_Write(MASK_RANK_LDO_REG, 0x00);
  STPMU1_Register_Write(BUCK_PULL_DOWN_REG, 0x00);
  STPMU1_Register_Write(LDO14_PULL_DOWN_REG, 0x00);
  STPMU1_Register_Write(LDO56_PULL_DOWN_REG, 0x00);
  STPMU1_Register_Write(BUCK_ICC_TURNOFF_REG, 0x30);
  STPMU1_Register_Write(LDO_ICC_TURNOFF_REG, 0x3b);

  /* vddcore */
  STPMU1_Regulator_Voltage_Set(STPMU1_BUCK1, 1200);
  STPMU1_Regulator_Enable(STPMU1_BUCK1);

  /* vdd2_ddr */
  STPMU1_Regulator_Voltage_Set(STPMU1_BUCK2, 1200);
  STPMU1_Regulator_Enable(STPMU1_BUCK2);

  /* vdd */
  STPMU1_Regulator_Voltage_Set(STPMU1_BUCK3, 1800);
  STPMU1_Regulator_Enable(STPMU1_BUCK3);

  /* 3v3 */
  //STPMU1_Regulator_Voltage_Set(STPMU1_BUCK4, 3300);
  //STPMU1_Regulator_Enable(STPMU1_BUCK4);

  /* 1v8_audio */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO1, 1800);
  STPMU1_Regulator_Enable(STPMU1_LDO1);

  /* vdd_emmc */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO2, 2900);
  STPMU1_Regulator_Enable(STPMU1_LDO2);

  /* vdd1_ddr */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO3, 0xFFFF);
  STPMU1_Regulator_Enable(STPMU1_LDO3);

  /* vdd_usb */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO4, 3300);
  STPMU1_Regulator_Enable(STPMU1_LDO4);

  /* vdda */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO5, 2900);
  STPMU1_Regulator_Enable(STPMU1_LDO5);

  /* 2v8 */
  STPMU1_Regulator_Voltage_Set(STPMU1_LDO6, 2800);
  STPMU1_Regulator_Enable(STPMU1_LDO6);

  STPMU1_Regulator_Enable(STPMU1_VREFDDR);

  return status;
}

uint32_t BSP_PMIC_SwitchOff(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  STPMU1_Register_Write(MAIN_CONTROL_REG, 0x01);
  return status;
}

__weak void BSP_PMIC_INTn_Callback(PMIC_IRQn IRQn)
{
  switch (IRQn)
  {
    case IT_PONKEY_F:
      printf("IT_PONKEY_F");
      break;

    case IT_PONKEY_R:
      printf("IT_PONKEY_R");
      break;

    case IT_WAKEUP_F:
      printf("IT_WAKEUP_F");
      break;

    case IT_WAKEUP_R:
      printf("IT_WAKEUP_R");
      break;

    case IT_VBUS_OTG_F:
      printf("IT_VBUS_OTG_F");
      break;

    case IT_SWOUT_F:
      printf("IT_SWOUT_F");
      break;

    case IT_TWARN_R:
      printf("IT_TWARN_R");
      break;

    case IT_TWARN_F:
      printf("IT_TWARN_F");
      break;

    default:
      printf("%d",IRQn);
      break;
  }
  printf(" Interrupt received\n\r");
}

void STPMU1_INTn_Callback(PMIC_IRQn IRQn) {
  BSP_PMIC_INTn_Callback(IRQn);
};


void BSP_PMIC_INTn_IRQHandler(void)
{
  /*printf("%s:%d\n\r", __FUNCTION__, __LINE__);*/
  /* Call HAL EXTI IRQ Handler to clear appropriate flags */
  HAL_GPIO_EXTI_IRQHandler(PMIC_INTn_PIN);

  STPMU1_IrqHandler();
}

void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *hI2c4)
{
  while(1);
}

/**
  * @}
  */
  
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
